module.exports = [
    // ========== 1.1 操作系统的基本概念 ==========
    {
      title: "操作系统是对()进行管理的软件。",
      choice: ["软件", "硬件", "计算机资源", "应用程序"],
      rightIndex: -1
    },
    {
      title: "下面的()资源不是操作系统应该管理的。",
      choice: ["CPU", "内存", "外存", "源程序"],
      rightIndex: -1
    },
    {
      title: "下列选项中，()不是操作系统关心的问题。",
      choice: ["管理计算机裸机", "设计、提供用户程序与硬件系统的界面", "管理计算机系统资源", "高级程序设计语言的编译器"],
      rightIndex: -1
    },
    {
      title: "操作系统的基本功能是()",
      choice: ["提供功能强大的网络管理工具", "提供用户界面方便用户使用", "提供方便的可视化编辑程序", "控制和管理系统内的各种资源"],
      rightIndex: -1
    },
    {
      title: "现代操作系统中最基本的两个特征是()",
      choice: ["并发和不确定", "并发和共享", "共享和虚拟", "虚拟和不确定"],
      rightIndex: -1
    },
    {
      title: "下列关于并发性的叙述中，正确的是()",
      choice: [
        "并发性是指若干事件在同一时刻发生",
        "并发性是指若干事件在不同时刻发生",
        "并发性是指若干事件在同一时间间隔内发生",
        "并发性是指若干事件在不同时间间隔内发生"
      ],
      rightIndex: -1
    },
    {
      title: "用户可以通过()两种方式来使用计算机。",
      choice: ["命令接口和函数", "命令接口和系统调用", "命令接口和文件管理", "设备管理方式和系统调用"],
      rightIndex: -1
    },
    {
      title: "系统调用是由操作系统提供给用户的，它()",
      choice: [
        "直接通过键盘交互方式使用",
        "只能通过用户程序间接使用",
        "是命令接口中的命令",
        "与系统的命令一样"
      ],
      rightIndex: -1
    },
    {
      title: "操作系统提供给编程人员的接口是()",
      choice: ["库函数", "高级语言", "系统调用", "子程序"],
      rightIndex: -1
    },
    {
      title: "系统调用的目的是()",
      choice: ["请求系统服务", "中止系统服务", "申请系统资源", "释放系统资源"],
      rightIndex: -1
    },
    {
      title: "为了方便用户直接或间接地控制自己的作业，操作系统向用户提供了命令接口，该接口又可进一步分为()",
      choice: [
        "联机用户接口和脱机用户接口",
        "程序接口和图形接口",
        "联机用户接口和程序接口",
        "脱机用户接口和图形接口"
      ],
      rightIndex: -1
    },
    {
      title: "以下关于操作系统的叙述中，错误的是()",
      choice: [
        "操作系统是管理资源的程序",
        "操作系统是管理用户程序执行的程序",
        "操作系统是能使系统资源提高效率的程序",
        "操作系统是用来编程的程序"
      ],
      rightIndex: -1
    },
    {
      title: "【2009统考真题】单处理机系统中，可并行的是() Ⅰ.进程与进程 Ⅱ.处理机与设备 Ⅲ.处理机与通道 IV.设备与设备",
      choice: ["I、II、III", "I、II、IV", "I、III、IV", "II、III、IV"],
      rightIndex: -1
    },
    {
      title: "【2010统考真题】下列选项中，操作系统提供给应用程序的接口是()",
      choice: ["系统调用", "中断", "库函数", "原语"],
      rightIndex: -1
    },
  
    // ========== 1.2 操作系统发展历程 ==========
    {
      title: "提高单机资源利用率的关键技术是()",
      choice: ["脱机技术", "虚拟技术", "交换技术", "多道程序设计技术"],
      rightIndex: -1
    },
    {
      title: "批处理系统的主要缺点是()",
      choice: ["系统吞吐量小", "CPU利用率不高", "资源利用率低", "无交互能力"],
      rightIndex: -1
    },
    {
      title: "下列选项中，不属于多道程序设计的基本特征的是()",
      choice: ["制约性", "间断性", "顺序性", "共享性"],
      rightIndex: -1
    },
    {
      title: "操作系统的基本类型主要有()",
      choice: [
        "批处理操作系统、分时操作系统和多任务系统",
        "批处理操作系统、分时操作系统和实时操作系统",
        "单用户系统、多用户系统和批处理操作系统",
        "实时操作系统、分时操作系统和多用户系统"
      ],
      rightIndex: -1
    },
    {
      title: "实时操作系统必须在()内处理来自外部的事件。",
      choice: ["一个机器周期", "被控制对象规定时间", "周转时间", "时间片"],
      rightIndex: -1
    },
    {
      title: "()不是设计实时操作系统的主要追求目标。",
      choice: ["安全可靠", "资源利用率", "及时响应", "快速处理"],
      rightIndex: -1
    },
    {
      title: "下列()应用工作最好采用实时操作系统平台。 I.航空订票 II.办公自动化 III.机床控制 IV. AutoCAD V.工资管理系统 VI.股票交易系统",
      choice: ["I、II和III", "I、III和IV", "I、V和IV", "I、III和VI"],
      rightIndex: -1
    },
    {
      title: "下列关于分时系统的叙述中，错误的是()",
      choice: [
        "分时系统主要用于批处理作业",
        "分时系统中每个任务依次轮流使用时间片",
        "分时系统的响应时间好",
        "分时系统是一种多用户操作系统"
      ],
      rightIndex: -1
    },
    {
      title: "分时系统的一个重要性能是系统的响应时间，对操作系统的()因素进行改进有利于改善系统的响应时间。",
      choice: ["加大时间片", "采用静态页式管理", "优先级+非抢占式调度算法", "代码可重入"],
      rightIndex: -1
    },
    {
      title: "分时系统追求的目标是()",
      choice: ["充分利用I/O设备", "比较快速响应用户", "提高系统吞吐率", "充分利用内存"],
      rightIndex: -1
    },
    {
      title: "在分时系统中，时间片一定时，()响应时间越长。",
      choice: ["内存越多", "内存越少", "用户数越多", "用户数越少"],
      rightIndex: -1
    },
    {
      title: "在分时系统中，为使多个进程能够及时与系统交互，最关键的问题是能在短时间内，使所有就绪进程都能运行。当就绪进程数为100时，为保证响应时间不超过2s，此时的时间片最大应为()",
      choice: ["10ms", "20ms", "50ms", "100ms"],
      rightIndex: -1
    },
    {
      title: "操作系统有多种类型。允许多个用户以交互的方式使用计算机的操作系统，称为()；允许多个用户将若干作业提交给计算机系统集中处理的操作系统，称为()；在()的控制下，计算机系统能及时处理由过程控制反馈的数据，并及时做出响应；在IBM-PC中，操作系统称为()",
      choice: ["批处理系统", "分时操作系统", "实时操作系统", "微型计算机操作系统"],
      rightIndex: -1
    },
    {
      title: "下列各种系统中，()可以使多个进程并行执行。",
      choice: ["分时系统", "多处理器系统", "批处理系统", "实时系统"],
      rightIndex: -1
    },
    {
      title: "下列关于操作系统的叙述中，正确的是()",
      choice: [
        "批处理操作系统必须在响应时间内处理完一个任务",
        "实时操作系统须在规定时间内处理完来自外部的事件",
        "分时操作系统必须在周转时间内处理完来自外部的事件",
        "分时操作系统必须在调度时间内处理完来自外部的事件"
      ],
      rightIndex: -1
    },
    {
      title: "引入多道程序技术的前提条件之一是系统具有()",
      choice: ["多个CPU", "多个终端", "中断功能", "分时功能"],
      rightIndex: -1
    },
    {
      title: "【2016统考真题】下列关于批处理系统的叙述中，正确的是() I.批处理系统允许多个用户与计算机直接交互 II.批处理系统分为单道批处理系统和多道批处理系统 III.中断技术使得多道批处理系统的I/O设备可与CPU并行工作",
      choice: ["仅II、III", "仅II", "仅I、II", "仅I、III"],
      rightIndex: -1
    },
    {
      title: "【2017统考真题】与单道程序系统相比，多道程序系统的优点是() I.CPU利用率高 II.系统开销小 III.系统吞吐量大 IV. I/O设备利用率高",
      choice: ["仅I、III", "仅I、IV", "仅II、III", "仅I、III、IV"],
      rightIndex: -1
    },
    {
      title: "【2018统考真题】下列关于多任务操作系统的叙述中，正确的是() I.具有并发和并行的特点 II.需要实现对共享资源的保护 III.需要运行在多CPU的硬件平台上",
      choice: ["仅I", "仅II", "仅I、II", "I、II、III"],
      rightIndex: -1
    },
    {
      title: "【2022统考真题】下列关于多道程序系统的叙述中，不正确的是()",
      choice: [
        "支持进程的并发执行",
        "不必支持虚拟存储管理",
        "需要实现对共享资源的管理",
        "进程数越多CPU利用率越高"
      ],
      rightIndex: -1
    },
  
    // ========== 1.3 操作系统的运行环境 ==========
    {
      title: "下列关于操作系统的说法中，错误的是() I.在通用操作系统管理下的计算机上运行程序，需要向操作系统预订运行时间 II.在通用操作系统管理下的计算机上运行程序，需要确定起始地址，并从这个地址开始执行 III.操作系统需要提供高级程序设计语言的编译器 IV.管理计算机系统资源是操作系统关心的主要问题",
      choice: ["I", "I、III", "II、III", "I、II、III、IV"],
      rightIndex: -1
    },
    {
      title: "下列说法中，正确的是() I.批处理的主要缺点是需要大量内存 II.当计算机提供了核心态和用户态时，输入/输出指令必须在核心态下执行 III.操作系统中采用多道程序设计技术的最主要原因是提高CPU和外部设备的可靠性 IV.操作系统中，通道技术是一种硬件技术",
      choice: ["I、II", "I、III", "II、IV", "II、III、IV"],
      rightIndex: -1
    },
    {
      title: "下列关于系统调用的说法中，正确的是() I.用户程序使用系统调用命令，该命令经过编译后形成若干参数和陷入指令 II.用户程序使用系统调用命令，该命令经过编译后形成若干参数和屏蔽中断指令 III.用户程序创建一个新进程，需使用操作系统提供的系统调用接口 IV.当操作系统完成用户请求的系统调用功能后，应使CPU从内核态转到用户态",
      choice: ["I、III", "III、IV", "I、III、IV", "II、III、IV"],
      rightIndex: -1
    },
    {
      title: "()是操作系统必须提供的功能。",
      choice: ["图形用户界面(GUI)", "为进程提供系统调用命令", "中断处理", "编译源程序"],
      rightIndex: -1
    },
    {
      title: "CPU执行的指令被分为两类，其中有一类称为特权指令，它只允许()使用。",
      choice: ["管理员", "联机用户", "目标程序", "操作系统"],
      rightIndex: -1
    },
    {
      title: "在中断发生后，进入中断处理的程序属于()",
      choice: ["用户程序", "可能是用户程序，也可能是OS程序", "操作系统程序", "单独的程序，既不是用户程序也不是OS程序"],
      rightIndex: -1
    },
    {
      title: "CPU的状态分为用户态和内核态，从用户态转换到内核态的唯一途径是()",
      choice: ["修改程序状态字指令", "中断屏蔽", "中断", "中断处理程序"],
      rightIndex: -1
    },
    {
      title: "下列指令中，可以在用户态执行的是() I.置时钟指令 II.停机指令 III.存数指令 IV.寄存器清零指令",
      choice: ["I、IV", "III、IV", "II、III、IV", "I、III"],
      rightIndex: -1
    },
    {
      title: "下列指令中，必须在内核态执行的是() I.陷入指令 II.系统调用指令 III.开中断指令 IV.转移指令 V.中断屏蔽字设置指令",
      choice: ["I、II、III、IV", "II、III", "III、V", "I、IV"],
      rightIndex: -1
    },
    {
      title: "下列程序中，必须在内核态执行的是() I.磁盘调度程序 II.中断处理程序 III.设备驱动程序 IV.操作系统初始化程序",
      choice: ["I、II、III、IV", "I、II、III", "I、II、IV", "II、III"],
      rightIndex: -1
    },
    {
      title: "当CPU处于内核态时，它可以执行的指令是()",
      choice: ["只有特权指令", "只有非特权指令", "只有访管指令", "除访管指令之外的全部指令"],
      rightIndex: -1
    },
    {
      title: "下列中断事件中能引起外部中断的事件是() I.时钟中断 II.访管中断 III.缺页中断",
      choice: ["I", "III", "I和II", "II和III"],
      rightIndex: -1
    },
    {
      title: "下列关于库函数和系统调用的说法中，不正确的是()",
      choice: [
        "库函数运行在用户态，系统调用运行在内核态",
        "使用库函数时开销较小，使用系统调用时开销较大",
        "库函数不方便替换，系统调用通常很方便被替换",
        "库函数可以很方便地调试，而系统调用很麻烦"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于系统调用和一般过程调用的说法中，正确的是()",
      choice: [
        "两者都需要将当前CPU中的PSW和PC的值压栈，以保存现场信息",
        "系统调用的被调用过程一定运行在内核态",
        "一般过程调用的被调用过程一定运行在用户态",
        "两者的调用过程与被调用过程一定都运行在用户态"
      ],
      rightIndex: -1
    },
    {
      title: "用户在程序中试图读某文件的第100个逻辑块，使用操作系统提供的()接口。",
      choice: ["系统调用", "键盘命令", "原语", "图形用户接口"],
      rightIndex: -1
    },
    {
      title: "【2011统考真题】下列选项中，在用户态执行的是()",
      choice: ["命令解释程序", "缺页处理程序", "进程调度程序", "时钟中断处理程序"],
      rightIndex: -1
    },
    {
      title: "【2012统考真题】下列选项中，不可能在用户态发生的事件是()",
      choice: ["系统调用", "外部中断", "进程切换", "缺页"],
      rightIndex: -1
    },
    {
      title: "【2012统考真题】中断处理和子程序调用都需要压栈以保护现场，中断处理一定会保存而子程序调用不需要保存其内容的是()",
      choice: ["程序计数器", "程序状态字寄存器", "通用数据寄存器", "通用地址寄存器"],
      rightIndex: -1
    },
    {
      title: "【2013统考真题】下列选项中，会导致用户进程从用户态切换到内核态的操作是() I.整数除以零 II. sin() 函数调用 III.read系统调用",
      choice: ["仅I、II", "仅I、III", "仅II、III", "I、II和III"],
      rightIndex: -1
    },
    {
      title: "【2014统考真题】下列指令中，不能在用户态执行的是()",
      choice: ["trap指令", "跳转指令", "压栈指令", "关中断指令"],
      rightIndex: -1
    },
    {
      title: "【2015统考真题】处理外部中断时，应该由操作系统保存的是()",
      choice: ["程序计数器(PC)的内容", "通用寄存器的内容", "块表(TLB)中的内容", "Cache中的内容"],
      rightIndex: -1
    },
    {
      title: "【2015统考真题】假定下列指令已装入指令寄存器，则执行时不可能导致CPU从用户态变为内核态(系统态)的是()",
      choice: [
        "DIV R0， R1；(R0)/(R1)→R0",
        "INTn；产生软中断",
        "NOT R0；寄存器RO的内容取非",
        "MOV R0， addr；把地址addr处的内存数据放入寄存器R0"
      ],
      rightIndex: -1
    },
    {
      title: "【2016统考真题】异常是指令执行过程中在处理器内部发生的特殊事件，中断是来自处理器外部的请求事件。下列关于中断或异常情况的叙述中，错误的是()",
      choice: [
        "\"访存时缺页\"属于中断",
        "\"整数除以0\"属于异常",
        "\"DMA传送结束\"属于中断",
        "\"存储保护错\"属于异常"
      ],
      rightIndex: -1
    },
    {
      title: "【2017统考真题】执行系统调用的过程包括如下主要操作，正确的执行顺序是() ①返回用户态；②执行陷入(trap)指令；③传递系统调用参数；④执行相应的服务程序",
      choice: ["②→③→①→④", "②→④→③→①", "③→②→④→①", "③→④→②→①"],
      rightIndex: -1
    },
    {
      title: "【2018统考真题】定时器产生时钟中断后，由时钟中断服务程序更新的部分内容是() I.内核中时钟变量的值 II.当前进程占用CPU的时间 III.当前进程在时间片内的剩余执行时间",
      choice: ["仅I、II", "仅II、III", "仅I、III", "I、II、III"],
      rightIndex: -1
    },
    {
      title: "【2019统考真题】下列关于系统调用的叙述中，正确的是() I.在执行系统调用服务程序的过程中，CPU处于内核态 II.操作系统通过提供系统调用避免用户程序直接访问外设 III.不同的操作系统为应用程序提供了统一的系统调用接口 IV.系统调用是操作系统内核为应用程序提供服务的接口",
      choice: ["仅I、IV", "仅II、III", "仅I、II、IV", "仅I、III、IV"],
      rightIndex: -1
    },
    {
      title: "【2020统考真题】下列与中断相关的操作中，由操作系统完成的是() I.保存被中断程序的中断点 II.提供中断服务 III.初始化中断向量表 IV.保存中断屏蔽字",
      choice: ["仅I、II", "仅I、II、IV", "仅III、IV", "仅II、III、IV"],
      rightIndex: -1
    },
    {
      title: "【2021统考真题】下列指令中，只能在内核态执行的是()",
      choice: ["trap指令", "I/O指令", "数据传送指令", "设置断点指令"],
      rightIndex: -1
    },
    {
      title: "【2021统考真题】下列选项中，通过系统调用完成的操作是()",
      choice: ["页置换", "进程调度", "创建新进程", "生成随机整数"],
      rightIndex: -1
    },
    {
      title: "【2022统考真题】下列关于CPU 模式的叙述中，正确的是()",
      choice: [
        "CPU处于用户态时只能执行特权指令",
        "CPU处于内核态时只能执行特权指令",
        "CPU处于用户态时只能执行非特权指令",
        "CPU处于内核态时只能执行非特权指令"
      ],
      rightIndex: -1
    },
    {
      title: "【2022统考真题】执行系统调用的过程涉及下列操作，其中由操作系统完成的是() I.保存断点和程序状态字 II.保存通用寄存器的内容 III.执行系统调用服务例程 IV.将CPU模式改为内核态",
      choice: ["仅I、III", "仅II、III", "仅II、IV", "仅II、III、IV"],
      rightIndex: -1
    },
    {
      title: "【2023统考真题】在操作系统内核中，中断向量表适合采用的数据结构是()",
      choice: ["数组", "队列", "单向链表", "双向链表"],
      rightIndex: -1
    },
    {
      title: "【2024统考真题】下列关于中断、异常和系统调用的叙述中，错误的是()",
      choice: [
        "中断或异常发生时，CPU处于内核态",
        "每个系统调用都有对应的内核服务例程",
        "中断处理程序开始执行时，CPU处于内核态",
        "系统添加新类型设备时，需要注册相应的中断服务例程"
      ],
      rightIndex: -1
    },
  
    // ========== 1.4～1.6 操作系统结构、引导与虚拟机 ==========
    {
      title: "用()设计的操作系统结构清晰且便于调试。",
      choice: ["分层式构架", "模块化构架", "微内核构架", "宏内核构架"],
      rightIndex: -1
    },
    {
      title: "下列关于分层式结构操作系统的说法中()是错误的。",
      choice: [
        "各层之间只能是单向依赖或单向调用",
        "容易实现在系统中增加或替换一层而不影响其他层",
        "具有非常灵活的依赖关系",
        "系统效率较低"
      ],
      rightIndex: -1
    },
    {
      title: "下列选项中，()不属于模块化操作系统的特点。",
      choice: [
        "很多模块化的操作系统，可以支持动态加载新模块到内核，适应性强",
        "内核中的某个功能模块出错不会导致整个系统崩溃，可靠性高",
        "内核中的各个模块，可以相互调用，无须通过消息传递进行通信，效率高",
        "各模块间相互依赖，相比于分层式操作系统，模块化操作系统更难调试和验证"
      ],
      rightIndex: -1
    },
    {
      title: "相对于微内核系统，()不属于大内核操作系统的缺点。",
      choice: ["占用内存空间大", "缺乏可扩展性而不方便移植", "内核切换太慢", "可靠性较低"],
      rightIndex: -1
    },
    {
      title: "下列说法中，()不适合描述微内核操作系统。",
      choice: ["内核足够小", "功能分层设计", "基于C/S模式", "策略与机制分离"],
      rightIndex: -1
    },
    {
      title: "对于以下五种服务，在采用微内核结构的操作系统中，()不宜放在微内核中。 I.进程间通信机制 II.低级I/O III.低级进程管理和调度 IV.中断和陷入处理 V.文件系统服务",
      choice: ["I、II和III", "II和V", "仅V", "IV和V"],
      rightIndex: -1
    },
    {
      title: "相对于传统操作系统结构，采用微内核结构设计和实现操作系统有诸多好处，下列()是微内核结构的特点。 I.使系统更高效 II.添加系统服务时不必修改内核 III.微内核结构没有单一内核稳定 IV.使系统更可靠",
      choice: ["I、III、IV", "I、II、IV", "II、IV", "I、IV"],
      rightIndex: -1
    },
    {
      title: "下列关于操作系统结构的说法中，正确的是() I.当前广泛使用的Windows操作系统采用的是分层式OS结构 II.模块化的OS结构设计的基本原则是，每一层都仅使用其底层所提供的功能和服务，这样就使系统的调试和验证都变得容易 III.因为微内核结构能有效支持多处理机运行，所以非常适合于分布式系统环境 IV.采用微内核结构设计和实现操作系统具有诸多好处，如添加系统服务时，不必修改内核、使系统更高效",
      choice: ["I和II", "I和III", "III", "III和IV"],
      rightIndex: -1
    },
    {
      title: "下列关于微内核操作系统的描述中，不正确的是()",
      choice: [
        "可增加操作系统的可靠性",
        "可提高操作系统的执行效率",
        "可提高操作系统的可移植性",
        "可提高操作系统的可拓展性"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于操作系统外核(exokernel)的说法中，错误的是()",
      choice: [
        "外核可以给用户进程分配未经抽象的硬件资源",
        "用户进程通过调用\"库\"请求操作系统外核的服务",
        "外核负责完成进程调度",
        "外核可以减少虚拟硬件资源的\"映射\"开销，提升系统效率"
      ],
      rightIndex: -1
    },
    {
      title: "对于计算机操作系统引导，描述不正确的是()",
      choice: [
        "计算机的引导程序驻留在ROM中，开机后自动执行",
        "引导程序先做关键部位的自检，并识别已连接的外设",
        "引导程序会将硬盘中存储的操作系统全部加载到内存中",
        "若计算机中安装了双系统，引导程序会与用户交互加载有关系统"
      ],
      rightIndex: -1
    },
    {
      title: "存放操作系统自举程序的芯片是()",
      choice: ["SRAM", "DRAM", "ROM", "CMOS"],
      rightIndex: -1
    },
    {
      title: "计算机操作系统的引导程序位于()中。",
      choice: ["主板BIOS", "片外Cache", "主存ROM区", "硬盘"],
      rightIndex: -1
    },
    {
      title: "计算机的启动过程是() ①CPU加电，CS：IP指向FFFF0H；②进行操作系统引导；③执行JMP指令跳转到BIOS；④登记BIOS中断例程入口地址；⑤硬件自检。",
      choice: ["①②③④⑤", "①③⑤④②", "①③④⑤②", "①⑤③④②"],
      rightIndex: -1
    },
    {
      title: "检查分区表是否正确，确定哪个分区为活动分区，并在程序结束时将该分区的启动程序(操作系统引导扇区)调入内存加以执行，这是()的任务。",
      choice: ["MBR", "引导程序", "操作系统", "BIOS"],
      rightIndex: -1
    },
    {
      title: "下列关于虚拟机的说法中，正确的是() I.虚拟机可以用软件实现 II.虚拟机可以用硬件实现 III.多台虚拟机可同时运行在同一物理机器上，它实现了真正的并行",
      choice: ["I和II", "I和III", "仅I", "I、II和III"],
      rightIndex: -1
    },
    {
      title: "下列关于VMware workstation虚拟机的说法中，错误的是()",
      choice: [
        "真实硬件不会直接执行虚拟机中的敏感指令",
        "虚拟机中只能安装一种操作系统",
        "虚拟机是运行在计算机中的一个应用程序",
        "虚拟机文件封装在一个文件夹中，并存储在数据存储器中"
      ],
      rightIndex: -1
    },
    {
      title: "虚拟机的实现离不开虚拟机管理程序(VMM)，下列关于VMM的说法中正确的是() I.第一类VMM直接运行在硬件上，其效率通常高于第二类VMM II.由于VMM的上层需要支持操作系统的运行、应用程序的运行，因此实现VMM的代码量通常大于实现一个完整操作系统的代码量 III.VMM可将一台物理机器虚拟化为多台虚拟机器 IV.为了支持客户操作系统的运行，第二类VMM需要完全运行在最高特权级",
      choice: ["I、II和III", "I和III", "I、III和IV", "I、II、III、IV"],
      rightIndex: -1
    },
    {
      title: "【2013统考真题】计算机开机后，操作系统最终被加载到()",
      choice: ["BIOS", "ROM", "EPROM", "RAM"],
      rightIndex: -1
    },
    {
      title: "【2022统考真题】下列选项中，需要在操作系统进行初始化过程中创建的是(",
      choice: ["中断向量表", "文件系统的根目录", "硬盘分区表", "文件系统的索引结点表"],
      rightIndex: -1
    },
    {
      title: "【2023统考真题】与宏内核操作系统相比，下列特征中，微内核操作系统具有的是() I.较好的性能 II.较高的可靠性 III.较高的安全性 IV.较强的可扩展性",
      choice: ["仅II、IV", "仅I、II、III", "仅I、III、IV", "仅II、III、IV"],
      rightIndex: -1
    }
  ];