//目前只有进程第一小节
module.exports = [
    {
      title: "一个进程映像是( )",
      choice: [
        "由协处理器执行的一个程序",
        "一个独立的程序+数据集",
        "PCB结构与程序和数据的组合",
        "一个独立的程序"
      ],
      rightIndex: -1
    },
    {
      title: "进程之间交换数据不能通过( )途径进行。",
      choice: [
        "共享文件",
        "消息传递",
        "访问进程地址空间",
        "访问共享存储区"
      ],
      rightIndex: -1
    },
    {
      title: "进程与程序的根本区别是( )",
      choice: [
        "静态和动态特点",
        "是不是被调入内存",
        "是不是具有就绪、运行和等待三种状态",
        "是不是占有处理器"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于进程的描述中，最不符合操作系统对进程的理解的是( )",
      choice: [
        "进程是在多程序环境中的完整程序",
        "进程可以由程序、数据和PCB描述",
        "线程(Thread)是一种特殊的进程",
        "进程是程序在一个数据集合上的运行过程，它是系统进行资源分配和调度的一个独立单元"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于并发进程特性的叙述中，正确的是( )",
      choice: [
        "进程是一个动态过程，其生命周期是连续的",
        "并发进程执行完毕后，一定能够得到相同的结果",
        "并发进程对共享变量的操作结果与执行速度无关",
        "并发进程的运行结果具有不可再现性"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于进程的叙述中，正确的是( )",
      choice: [
        "进程获得处理器运行是通过调度得到的",
        "优先级是进程调度的重要依据，一旦确定不能改动",
        "在单处理器系统中，任何时刻都只有一个进程处于运行态",
        "进程申请处理器而得不到满足时，其状态变为阻塞态"
      ],
      rightIndex: -1
    },
    {
      title: "并发进程执行的相对速度是( )",
      choice: [
        "由进程的程序结构决定的",
        "由进程自己来控制的",
        "与进程调度策略有关",
        "在进程被创建时确定的"
      ],
      rightIndex: -1
    },
    {
      title: "下列任务中，( )不是由进程创建原语完成的。",
      choice: [
        "申请PCB并初始化",
        "为进程分配内存空间",
        "为进程分配CPU",
        "将进程插入就绪队列"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于进程和程序的叙述中，错误的是( )",
      choice: [
        "一个进程在其生命周期中可执行多个程序",
        "一个进程在同一时刻可执行多个程序",
        "一个程序的多次运行可形成多个不同的进程",
        "一个程序的一次执行可产生多个进程"
      ],
      rightIndex: -1
    },
    {
      title: "下列选项中，导致创建新进程的操作是( )\nI.用户登录\nII.高级调度发生时\nIII.操作系统响应用户提出的请求\nIV.用户打开了一个浏览器程序",
      choice: [
        "仅Ⅰ和IV",
        "仅Ⅱ和IV",
        "I、Ⅱ和IV",
        "全部"
      ],
      rightIndex: -1
    },
    {
      title: "操作系统是根据( )来对并发执行的进程进行控制和管理的。",
      choice: [
        "进程的基本状态",
        "进程控制块",
        "多道程序设计",
        "进程的优先权"
      ],
      rightIndex: -1
    },
    {
      title: "在任何时刻，一个进程的状态变化( )引起另一个进程的状态变化。",
      choice: [
        "必定",
        "一定不",
        "不一定",
        "不可能"
      ],
      rightIndex: -1
    },
    {
      title: "在单处理器系统中，若同时存在10个进程，则处于就绪队列中的进程最多有( )个。",
      choice: [
        "1",
        "8",
        "9",
        "10"
      ],
      rightIndex: -1
    },
    {
      title: "一个进程释放了一台打印机，它可能会改变( )的状态。",
      choice: [
        "自身进程",
        "输入/输出进程",
        "另一个等待打印机的进程",
        "所有等待打印机的进程"
      ],
      rightIndex: -1
    },
    {
      title: "系统进程所请求的一次I/O操作完成后，将使进程状态从( )",
      choice: [
        "运行态变为就绪态",
        "运行态变为阻塞态",
        "就绪态变为运行态",
        "阻塞态变为就绪态"
      ],
      rightIndex: -1
    },
    {
      title: "一个进程的基本状态可以从其他两种基本状态转变过去，这个基本的状态一定是( )",
      choice: [
        "运行态",
        "阻塞态",
        "就绪态",
        "终止态"
      ],
      rightIndex: -1
    },
    {
      title: "在分时系统中，通常处于( )的进程最多。",
      choice: [
        "运行态",
        "就绪态",
        "阻塞态",
        "终止态"
      ],
      rightIndex: -1
    },
    {
      title: "并发进程失去封闭性，是指( )",
      choice: [
        "多个相对独立的进程以各自的速度向前推进",
        "并发进程的执行结果与速度无关",
        "并发进程执行时，在不同时刻发生的错误",
        "并发进程共享变量， 其执行结果与速度有关"
      ],
      rightIndex: -1
    },
    {
      title: "通常用户进程被建立后，( )",
      choice: [
        "便一直存在于系统中，直到被操作人员撤销",
        "随着进程运行的正常或不正常结束而撤销",
        "随着时间片轮转而撤销与建立",
        "随着进程的阻塞或者唤醒而撤销与建立"
      ],
      rightIndex: -1
    },
    {
      title: "进程在处理器上执行时，( )",
      choice: [
        "进程之间是无关的， 具有封闭特性",
        "进程之间都有交互性，相互依赖、相互制约，具有并发性",
        "具有并发性，即同时执行的特性",
        "进程之间可能是无关的，但也可能是有交互性的"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于父进程和子进程的叙述中，正确的是( )",
      choice: [
        "为了标志父子关系，可让子进程和父进程拥有相同的PID",
        "父进程和子进程是相互独立的，可以并发执行",
        "撤销子进程时，一定会同时撤销父进程",
        "父进程创建了子进程，要等父进程执行完后，子进程才能执行"
      ],
      rightIndex: -1
    },
    {
      title: "若一个进程实体由PCB、共享正文段、数据堆段和数据栈段组成，请指出下列C语言程序中的内容及相关数据结构各位于哪一段中。\nI.全局赋值变量，( )\nII.未赋值的局部变量，( )\nIII.函数调用实参传递值，( )\nIV.用malloc() 要求动态分配的存储区，( )\nV.常量值(如1995、 \"string\")，( )\nVI.进程的优先级，( )",
      choice: [
        "PCB",
        "正文段",
        "堆段",
        "栈段"
      ],
      rightIndex: -1
    },
    {
      title: "同一程序经过多次创建，运行在不同的数据集上，形成了( )的进程。",
      choice: [
        "不同",
        "相同",
        "同步",
        "互斥"
      ],
      rightIndex: -1
    },
    {
      title: "PCB是进程存在的唯一标志，下列( )不属于PCB。",
      choice: [
        "进程ID",
        "CPU状态",
        "堆栈指针",
        "全局变量"
      ],
      rightIndex: -1
    },
    {
      title: "一个计算机系统中，进程的最大数量主要受到( )限制。",
      choice: [
        "内存大小",
        "用户数目",
        "打开的文件数",
        "外部设备数量"
      ],
      rightIndex: -1
    },
    {
      title: "进程创建完成后会进入一个序列，这个序列称为( )",
      choice: [
        "阻塞队列",
        "挂起序列",
        "就绪队列",
        "运行队列"
      ],
      rightIndex: -1
    },
    {
      title: "进程自身决定( )",
      choice: [
        "从运行态到阻塞态",
        "从运行态到就绪态",
        "从就绪态到运行态",
        "从阻塞态到就绪态"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于原语操作的叙述中，错误的是( )",
      choice: [
        "操作系统使用原语对进程进行管理和控制",
        "原语在执行过程中不允许被中断",
        "原语在内核态下执行，常驻内存",
        "原语被定义为\"原子操作\"，意思是其执行速度非常快"
      ],
      rightIndex: -1
    },
    {
      title: "用信箱实现进程间互通信息的通信机制要有两个通信原语，它们是( )",
      choice: [
        "发送原语和执行原语",
        "就绪原语和执行原语",
        "发送原语和接收原语",
        "就绪原语和接收原语"
      ],
      rightIndex: -1
    },
    {
      title: "速度最快的进程通信方式是( )",
      choice: [
        "消息传递",
        "Socket",
        "共享内存",
        "管道"
      ],
      rightIndex: -1
    },
    {
      title: "信箱通信是一种( )通信方式。",
      choice: [
        "直接通信",
        "间接通信",
        "低级通信",
        "信号量"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于信号发送和处理的描述中，错误的是( )",
      choice: [
        "一个进程可以给自己发送信号",
        "操作系统的内核可以给进程发送信号",
        "操作系统的内核对每种信号都有默认处理程序",
        "用户可以对每种信号自定义处理函数"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于信号的处理的描述中，错误的是( )",
      choice: [
        "当进程从内核态转为用户态时，会检查是否有待处理的信号",
        "当进程从用户态转为内核态时，也会检查是否有待处理的信号",
        "操作系统对某些信号的处理是可以忽略的",
        "操作系统允许进程通过系统调用，自定义某些信号的处理程序"
      ],
      rightIndex: -1
    },
    {
      title: "下面的叙述中，正确的是( )",
      choice: [
        "引入线程后，处理器只能在线程间切换",
        "引入线程后，处理器仍在进程间切换",
        "线程的切换，不会引起进程的切换",
        "线程的切换，可能引起进程的切换"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于线程的叙述中，正确的是( )",
      choice: [
        "线程包含CPU现场，可以独立执行程序",
        "每个线程都有自己独立的地址空间",
        "每个进程只能包含一个线程",
        "同一进程中的线程间通信也必须使用系统调用函数"
      ],
      rightIndex: -1
    },
    {
      title: "下面的叙述中，正确的是( )",
      choice: [
        "线程是比进程更小的能独立运行的基本单位，可以脱离进程独立运行",
        "引入线程可提高程序并发执行的程度，可进一步提高系统效率",
        "线程的引入增加了程序执行时的时空开销",
        "一个进程一定包含多个线程"
      ],
      rightIndex: -1
    },
    {
      title: "下面的叙述中，正确的是( )",
      choice: [
        "同一进程内的线程可并发执行，不同进程的线程只能串行执行",
        "同一进程内的线程只能串行执行，不同进程的线程可并发执行",
        "同一进程或不同进程内的线程都只能串行执行",
        "同一进程或不同进程内的线程都可以并发执行"
      ],
      rightIndex: -1
    },
    {
      title: "下列选项中，( )不是线程的优点。",
      choice: [
        "提高系统并发性",
        "节约系统资源",
        "便于进程通信",
        "增强进程安全性"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于进程和线程的说法中，正确的是( )",
      choice: [
        "一个进程可以包含一个或多个线程，一个线程可以属于一个或多个进程",
        "多线程技术具有明显的优越性，如速度快、通信简便、设备并行性高等",
        "由于线程不作为资源分配单位，线程之间可以无约束地并行执行",
        "线程又称轻量级进程，因为线程都比进程小"
      ],
      rightIndex: -1
    },
    {
      title: "在以下描述中，( )并不是多线程系统的特长。",
      choice: [
        "利用线程并行地执行矩阵乘法运算",
        "Web服务器利用线程响应HTTP请求",
        "键盘驱动程序为每个正在运行的应用配备一个线程，用以响应该应用的键盘输入",
        "基于GUI的调试程序用不同的线程分别处理用户输入、计算和跟踪等操作"
      ],
      rightIndex: -1
    },
    {
      title: "在进程转换时，下列( )转换是不可能发生的。",
      choice: [
        "就绪态→运行态",
        "运行态→就绪态",
        "运行态→阻塞态",
        "阻塞态→运行态"
      ],
      rightIndex: -1
    },
    {
      title: "当( )时，进程从执行状态转变为就绪态。",
      choice: [
        "进程被调度程序选中",
        "时间片到",
        "等待某一事件",
        "等待的事件发生"
      ],
      rightIndex: -1
    },
    {
      title: "两个合作进程(Cooperating Processes) 无法利用( )交换数据。",
      choice: [
        "文件系统",
        "共享内存",
        "高级语言程序设计中的全局变量",
        "消息传递系统"
      ],
      rightIndex: -1
    },
    {
      title: "以下可能导致一个进程从运行态变为就绪态的事件是( )",
      choice: [
        "一次I/O操作结束",
        "运行进程需做I/O操作",
        "运行进程结束",
        "出现了比现在进程优先级更高的进程"
      ],
      rightIndex: -1
    },
    {
      title: "( )必会引起进程切换。",
      choice: [
        "一个进程创建后，进入就绪态",
        "一个进程从运行态变为就绪态",
        "一个进程从阻塞态变为就绪态",
        "以上答案都不对"
      ],
      rightIndex: -1
    },
    {
      title: "进程处于( )时，它处于非阻塞态。",
      choice: [
        "等待从键盘输入数据",
        "等待协作进程的一个信号",
        "等待操作系统分配CPU时间",
        "等待网络数据进入内存"
      ],
      rightIndex: -1
    },
    {
      title: "一个进程被唤醒，意味着( )",
      choice: [
        "该进程可以重新竞争CPU",
        "优先级变大",
        "PCB移动到就绪队列之首",
        "进程变为运行态"
      ],
      rightIndex: -1
    },
    {
      title: "进程创建时，不需要做的是( )",
      choice: [
        "填写一个该进程的进程表项",
        "分配该进程适当的内存",
        "将该进程插入就绪队列",
        "为该进程分配CPU"
      ],
      rightIndex: -1
    },
    {
      title: "计算机两个系统中两个协作进程之间不能用来进行进程间通信的是( )",
      choice: [
        "数据库",
        "共享内存",
        "消息传递机制",
        "管道"
      ],
      rightIndex: -1
    },
    {
      title: "下面关于用户级线程和内核级线程的描述中，错误的是( )",
      choice: [
        "采用轮转调度算法，进程中设置内核级线程和用户级线程的效果完全不同",
        "跨进程的用户级线程调度也不需要内核参与，控制简单",
        "用户级线程可以在任何操作系统中运行",
        "若系统中只有用户级线程， 则CPU的调度对象是进程"
      ],
      rightIndex: -1
    },
    {
      title: "在内核级线程相对于用户级线程的优点的如下描述中，错误的是( )",
      choice: [
        "同一进程内的线程切换，系统开销小",
        "当内核线程阻塞时， CPU将会调度同一进程中的其他内核线程执行",
        "内核级线程的程序实体可以在内核态运行",
        "对多处理器系统，核心可以同时调度同一进程的多个线程并行运行"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于用户级线程相对于内核级线程的优点的描述中，错误的是( )",
      choice: [
        "一个线程阻塞不影响另一个线程的运行",
        "线程的调度不需要内核直接参与，控制简单",
        "线程切换代价小",
        "允许每个进程定制自己的调度算法，线程管理比较灵活"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于用户级线程的优点的描述中，不正确的是( )",
      choice: [
        "线程切换不需要切换到内核态",
        "支持不同的应用程序采用不同的调度算法",
        "在不同操作系统上不经修改就可直接运行",
        "同一个进程内的多个线程可以同时调度到多个处理器上执行"
      ],
      rightIndex: -1
    },
    {
      title: "下列选项中，可能导致用户级线程切换的事件是( )",
      choice: [
        "系统调用",
        "I/O请求",
        "异常处理",
        "线程同步"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于用户级线程的描述中，错误的是( )",
      choice: [
        "用户级线程由线程库进行管理",
        "用户级线程只有在创建和调度时需要内核的干预",
        "操作系统无法直接调度用户级线程",
        "线程库中线程的切换不会导致进程切换"
      ],
      rightIndex: -1
    },
    {
      title: "下面的说法中，正确的是( )",
      choice: [
        "不论是系统支持的线程还是用户级线程，其切换都需要内核的支持",
        "线程是资源分配的单位，进程是调度和分派的单位",
        "不管系统中是否有线程，进程都是拥有资源的独立单位",
        "在引入线程的系统中，进程仍是资源调度和分派的基本单位"
      ],
      rightIndex: -1
    },
    {
      title: "在多对一的线程模型中，当一个多线程进程中的某个线程被阻塞后，( )",
      choice: [
        "该进程的其他线程仍可继续运行",
        "整个进程都将阻塞",
        "该阻塞线程将被撤销",
        "该阻塞线程将永远不可能再执行"
      ],
      rightIndex: -1
    },
    {
      title: "并发性较好的多线程模型有( )\nI.一对一模型\nII.多对一模型\nIII.多对多模型",
      choice: [
        "仅I",
        "I和II",
        "I和III",
        "I、II和III"
      ],
      rightIndex: -1
    },
    {
      title: "下列关于多对一模型的叙述中，错误的是( )",
      choice: [
        "一个进程的多个线程不能并行运行在多个处理器上",
        "进程中的用户级线程由进程自己管理",
        "线程切换会导致进程切换",
        "一个线程的系统调用会导致整个进程阻塞"
      ],
      rightIndex: -1
    },
    {
      title: "【2010统考真题】下列选项中，导致创建新进程的操作是( )\nI.用户登录成功\nII.设备分配\nIII.启动程序执行",
      choice: [
        "仅Ⅰ和Ⅱ",
        "仅Ⅱ和Ⅲ",
        "仅Ⅰ和Ⅲ",
        "I、II、III"
      ],
      rightIndex: -1
    },
    {
      title: "【2011统考真题】在支持多线程的系统中、进程P创建的若干线程不能共享的是( )",
      choice: [
        "进程P的代码段",
        "进程P中打开的文件",
        "进程P的全局变量",
        "进程P中某线程的栈指针"
      ],
      rightIndex: -1
    },
    {
      title: "【2012统考真题】下列关于进程和线程的叙述中，正确的是( )",
      choice: [
        "不管系统是否支持线程，进程都是资源分配的基本单位",
        "线程是资源分配的基本单位，进程是调度的基本单位",
        "系统级线程和用户级线程的切换都需要内核的支持",
        "同一进程中的各个线程拥有各自不同的地址空间"
      ],
      rightIndex: -1
    },
    {
      title: "【2014统考真题】一个进程的读磁盘操作完成后，操作系统针对该进程必做的是( )",
      choice: [
        "修改进程状态为就绪态",
        "降低进程优先级",
        "给进程分配用户内存空间",
        "增加进程时间片大小"
      ],
      rightIndex: -1
    },
    {
      title: "【2014统考真题】下列关于管道(Pipe) 通信的叙述中，正确的是( )",
      choice: [
        "一个管道可实现双向数据传输",
        "管道的容量仅受磁盘容量大小限制",
        "进程对管道进行读操作和写操作都可能被阻塞",
        "一个管道只能有一个读进程或一个写进程对其操作"
      ],
      rightIndex: -1
    },
    {
      title: "【2015统考真题】下列选项中，会导致进程从执行态变为就绪态的事件是( )",
      choice: [
        "执行P(wait) 操作",
        "申请内存失败",
        "启动I/O设备",
        "被高优先级进程抢占"
      ],
      rightIndex: -1
    },
    {
      title: "【2018统考真题】下列选项中，可能导致当前进程P阻塞的事件是( )\nI.进程P申请临界资源\nII.进程P从磁盘读数据\nIII.系统将CPU分配给高优先权的进程",
      choice: [
        "仅I",
        "仅II",
        "仅I、II",
        "I、II、III"
      ],
      rightIndex: -1
    },
    {
      title: "【2019统考真题】下列选项中，可能会将进程唤醒的事件是( )\nI.I/O结束\nII.某进程退出临界区\nIII.当前进程的时间片用完",
      choice: [
        "仅I",
        "仅III",
        "仅I、II",
        "I、II、III"
      ],
      rightIndex: -1
    },
    {
      title: "【2019统考真题】下列关于线程的描述中，错误的是( )",
      choice: [
        "内核级线程的调度由操作系统完成",
        "操作系统为每个用户级线程建立一个线程控制块",
        "用户级线程间的切换比内核级线程间的切换效率高",
        "用户级线程可以在不支持内核级线程的操作系统上实现"
      ],
      rightIndex: -1
    },
    {
      title: "【2020统考真题】下列关于父进程与子进程的叙述中，错误的是( )",
      choice: [
        "父进程与子进程可以并发执行",
        "父进程与子进程共享虚拟地址空间",
        "父进程与子进程有不同的进程控制块",
        "父进程与子进程不能同时使用同一临界资源"
      ],
      rightIndex: -1
    },
    {
      title: "【2021统考真题】下列操作中，操作系统在创建新进程时，必须完成的是( )\nI.申请空白的进程控制块\nII.初始化进程控制块\nIII.设置进程状态为执行态",
      choice: [
        "仅I",
        "仅I、II",
        "仅I、III",
        "仅II、III"
      ],
      rightIndex: -1
    },
    {
      title: "【2022统考真题】下列事件或操作中。可能导致进程P由执行态变为阻塞态的是( )\nI.进程P读文件\nII.进程P的时间片用完\nIII.进程P申请外设\nIV.进程P执行信号量的wait()操作",
      choice: [
        "仅I、IV",
        "仅II、III",
        "仅III、IV",
        "仅I、III、IV"
      ],
      rightIndex: -1
    },
    {
      title: "【2023统考真题】下列操作完成时， 导致CPU从内核态转为用户态的是( )",
      choice: [
        "阻塞进程",
        "执行CPU调度",
        "唤醒进程",
        "执行系统调用"
      ],
      rightIndex: -1
    },
    {
      title: "【2023统考真题】下列由当前线程引起的事件或执行的操作中，可能导致该线程由执行态变为就绪态的是( )",
      choice: [
        "键盘输入",
        "缺页异常",
        "主动出让CPU",
        "执行信号量的wait()操作"
      ],
      rightIndex: -1
    },
    {
      title: "【2024统考真题】下列选项中，操作系统在终止进程时不一定执行的是( )",
      choice: [
        "终止子进程",
        "回收进程占用的设备",
        "释放进程控制块",
        "回收为进程分配的内存"
      ],
      rightIndex: -1
    },
    {
      title: "【2024统考真题】若进程P中的线程T先打开文件，得到文件描述符fd，再创建两个线程Ta和Tb， 则在下列资源中，Ta与Tb可共享的是( )\nI.进程P的地址空间\nII.线程T的栈\nIII.文件描述符fd",
      choice: [
        "仅I",
        "仅I、III",
        "仅II、III",
        "I、II、III"
      ],
      rightIndex: -1
    }
  ];